## Plans :heavy_check_mark:

<details>
  <summary><h2>Terrateam Plan Output :heavy_check_mark:</h2></summary>

**Dir**: .
**Workspace**: default
**Success**: :heavy_check_mark:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.example_aws.module.batch.aws_batch_job_definition.this["example"] will be created
+   resource "aws_batch_job_definition" "this" {
+       arn                   = (known after apply)
+       container_properties  = jsonencode(
            {
+               command                      = [
+                   "bash",
+                   "-c",
+                   "set",
                ]
+               executionRoleArn             = "arn:aws:iam::376942697097:role/example-scheduled-jobs-ecs-task-exec"
+               fargatePlatformConfiguration = {
+                   platformVersion = "LATEST"
                }
+               image                        = "public.ecr.aws/debian/debian:bullseye"
+               logConfiguration             = {
+                   logDriver = "awslogs"
+                   options   = {
+                       awslogs-group         = "/aws/batch/example-scheduled-jobs"
+                       awslogs-region        = "us-east-1"
+                       awslogs-stream-prefix = "example-scheduled-jobs"
                    }
                }
+               resourceRequirements         = [
+                   {
+                       type  = "VCPU"
+                       value = "1"
                    },
+                   {
+                       type  = "MEMORY"
+                       value = "2048"
                    },
                ]
            }
        )
+       id                    = (known after apply)
+       name                  = "example-scheduled-jobs"
+       platform_capabilities = [
+           "FARGATE",
        ]
+       propagate_tags        = true
+       revision              = (known after apply)
+       tags                  = {
+           "job_definitions" = "example"
+           "module"          = "batch"
        }
+       tags_all              = {
+           "job_definitions" = "example"
+           "managed-by"      = "Terraform"
+           "module"          = "batch"
+           "workspace"       = "terraform-example_scheduled_jobs-dev_dex4er"
        }
+       type                  = "container"

+       timeout {
+           attempt_duration_seconds = 60
        }
    }

  # module.example_aws.module.eventbridge.aws_cloudwatch_event_target.this["fargate_spot"] will be created
+   resource "aws_cloudwatch_event_target" "this" {
+       arn            = "arn:aws:batch:us-east-1:376942697097:job-queue/fargate_spot"
+       event_bus_name = "default"
+       id             = (known after apply)
+       rule           = "batch-rule"
+       target_id      = (known after apply)

+       batch_target {
+           job_definition = (known after apply)
+           job_name       = "example-scheduled-jobs"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:. workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 76.65 | 76.65 | 0.00|
| | **Total** | **76.65** | **76.65** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>

